# Sakila CodeAlong and Challenge

<img src='../Data/sakila-db-model.png'>

In [2]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

# ## Change username and password to match your personal MySQL Server settings
# username = 'root' # default username for MySQL db is root
# password = 'YOUR_PASSWORD' # whatever password you chose during MySQL installation.

# connection = f'mysql+pymysql://{username}:{password}@localhost/sakila'
# engine = create_engine(connection)

In [1]:
import json
with open('/Users/purvikansara/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
login['username']

'root'

In [4]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/sakila"
engine = create_engine(connection)

In [6]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

## Show the Tables

In [7]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

## 1. What is the average length of films by category?

In [10]:
q = '''SELECT  category.name , AVG(length)
FROM film
JOIN film_category
ON film.film_id = film_category.film_id
JOIN category
ON film_category.category_id = category.category_id
GROUP BY category.name
ORDER BY AVG(length) DESC;

'''

pd.read_sql(q, engine)

           name  AVG(length)
0        Sports     128.2027
1         Games     127.8361
2       Foreign     121.6986
3         Drama     120.8387
4        Comedy     115.8276
5        Family     114.7826
6         Music     113.6471
7        Travel     113.3158
8        Horror     112.4821
9      Classics     111.6667
10       Action     111.6094
11          New     111.1270
12    Animation     111.0152
13     Children     109.8000
14  Documentary     108.7500
15       Sci-Fi     108.1967

## 2. Sales have been lagging among young families, and you wish to target all family movies for a promotion. Identify all movies categorized as family films.

In [11]:
q = '''SELECT f.title AS 'Movie Title'
FROM film AS f
JOIN film_category AS fc
ON f.film_id = fc.film_id
JOIN category AS c 
ON fc.category_id = c.category_id
WHERE c.name = "Family";'''

pd.read_sql(q, engine)

         Movie Title
0        AFRICAN EGG
1      APACHE DIVINE
2     ATLANTIS CAUSE
3    BAKED CLEOPATRA
4          BANG KWAI
..               ...
64       SPLASH GUMP
65      SUNSET RACER
66     SUPER WYOMING
67  VIRTUAL SPOILERS
68      WILLOW TRACY

[69 rows x 1 columns]

## 3 You want to run an email marketing campaign in Canada, for which you will need the names and email addresses of all Canadian customers. Use joins to retrieve this information.

In [ ]:
q = '''  '''

pd.read_sql(q, engine)

# The following queries use subqueries

## 4. Find the customer's first and last name where the amount paid was greater than the average payment. Make sure to only show unique results.

In [12]:
q = '''SELECT DISTINCT customer.first_name, customer.last_name, payment.amount
FROM customer
JOIN payment
ON customer.customer_id = payment.customer_id
WHERE payment.amount > (SELECT AVG(payment.amount) FROM payment);'''

pd.read_sql(q, engine)

     first_name last_name  amount
0          MARY     SMITH    5.99
1          MARY     SMITH    9.99
2          MARY     SMITH    4.99
3          MARY     SMITH    7.99
4      PATRICIA   JOHNSON    4.99
...         ...       ...     ...
2691       WADE  DELVALLE    7.99
2692     AUSTIN   CINTRON    4.99
2693     AUSTIN   CINTRON    6.99
2694     AUSTIN   CINTRON    9.99
2695     AUSTIN   CINTRON    8.99

[2696 rows x 3 columns]

## 5. Find the total number of payments made by Mary Smith using subqueries.

In [13]:
q = '''SELECT COUNT(*) AS "Num Payments"
FROM (SELECT customer_id
FROM payment
WHERE customer_id = (SELECT customer_id
                        FROM customer
                        WHERE first_name = 'Mary' AND last_name = "Smith")) AS payment_id'''

pd.read_sql(q, engine)

   Num Payments
0            32

## 6. Use subqueries to display all actors who appear in the film Alone Trip.

In [14]:
q = '''SELECT first_name, last_name 
FROM actor
WHERE actor_id IN (SELECT actor_id
                	FROM film_actor
                	WHERE film_id in (SELECT film_id 
                                        FROM film 
                                        WHERE title = "ALONE TRIP"));'''

pd.read_sql(q, engine)

  first_name last_name
0         ED     CHASE
1       KARL     BERRY
2        UMA      WOOD
3      WOODY     JOLIE
4    SPENCER      DEPP
5      CHRIS      DEPP
6   LAURENCE   BULLOCK
7      RENEE      BALL

<img src = '../Data/Challenge.jpg'>

## 1. What are the titles, categories, and lengths of all films in the Sakila database that are longer than 120 minutes? Put the films in order by length.

In [ ]:
q = '''  '''

pd.read_sql(q, engine)

## 2. What are the first names, last names, and film titles of all actors named 'Penelope' in the Sakila database?

In [ ]:
q = '''  '''

pd.read_sql(q, engine)

# The following queries must use Subqueries for the statement.

## 3. Who are the actors that have acted in the film with film_id = 1

In [ ]:
q = '''  '''

pd.read_sql(q, engine)

## 4. What are the films that are in the English Language

In [ ]:
q = '''  '''

pd.read_sql(q, engine)

## 5. Who are the customers that belong to the store managed by Mike Hillyer?

In [ ]:
q = '''  '''

pd.read_sql(q, engine)